weekend-surge-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 24000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4418.339624999987,
    "medianResTime" : 4372.0,
    "minResTime" : 165.0,
    "maxResTime" : 11440.0,
    "pct1ResTime" : 6089.9000000000015,
    "pct2ResTime" : 6526.0,
    "pct3ResTime" : 7168.990000000002,
    "throughput" : 80.768920119538,
    "receivedKBytesPerSec" : 47.77419181650984,
    "sentKBytesPerSec" : 25.373436627106724
  },
  "POST /api/payment" : {
    "transaction" : "POST /api/payment",
    "sampleCount" : 24000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4418.339624999987,
    "medianResTime" : 4372.0,
    "minResTime" : 165.0,
    "maxResTime" : 11440.0,
    "pct1ResTime" : 6089.9000000000015,
    "pct2ResTime" : 6526.0,
    "pct3ResTime" : 7168.990000000002,
    "throughput" : 80.768920119538,
    "receivedKBytesPerSec" : 47.77419181650984,
    "sentKBytesPerSec" : 25.373436627106724
  }
}